Repository: raymond0208/CashCatalyst
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es, ja

source: Workspace
es: Espacio de trabajo
ja: ワークスペース

source: AI Analysis
es: Análisis de IA
ja: AI分析

source: Generate Advanced Analysis
es: Generar análisis avanzado
ja: 高度な分析を生成

source: Generate Cash Flow Statement
es: Generar estado de flujo de efectivo
ja: キャッシュフロー計算書を生成

source: Note: The cash flow statement is generated based on the transactions currently in your database. Additional options for custom date ranges and filtering will be available in future updates.
es: Nota: El estado de flujo de efectivo se genera en base a las transacciones actualmente en tu base de datos. Opciones adicionales para rangos de fechas personalizados y filtrado estarán disponibles en futuras actualizaciones.
ja: 注：キャッシュフロー計算書は、現在データベースにある取引に基づいて生成されます。今後のアップデートで、カスタム日付範囲やフィルタリングのオプションが追加される予定です。

source: Loading...
es: Cargando...
ja: 読み込み中...

source: Language
es: Idioma
ja: 言語

source: Home
es: Inicio
ja: ホーム

source: Cash Overview
es: Resumen de Efectivo
ja: キャッシュ概要

source: Cash Activities
es: Actividades de Efectivo
ja: 現金活動

source: Upload
es: Subir Archivos
ja: アップロード

source: Record Cash Transaction
es: Registrar transacción de efectivo
ja: 現金取引を記録

source: Date
es: Fecha
ja: 日付

source: Description
es: Descripción
ja: 説明

source: Amount
es: Monto
ja: 金額

source: Type
es: Tipo
ja: 種類

source: Salary & Supplier payments
es: Pagos de sueldos y a proveedores
ja: 給与および仕入先への支払い

source: Interest paid
es: Intereses pagados
ja: 支払利息

source: Income taxes
es: Impuestos sobre la renta
ja: 所得税

source: Other operating cashflow
es: Otros flujos de efectivo operativos
ja: その他の営業キャッシュフロー

source: Purchase of property&equipments
es: Compra de propiedades y equipos
ja: 資産および設備の購入

source: Sell of property&equipments
es: Venta de propiedades y equipos
ja: 資産および設備の売却

source: Purchase of investments
es: Compra de inversiones
ja: 投資の購入

source: Sale of investments
es: Venta de inversiones
ja: 投資の売却

source: Other investing cashflow
es: Otros flujos de efectivo de inversión
ja: その他の投資キャッシュフロー

source: Issuing shares
es: Emisión de acciones
ja: 株式の発行

source: Borrowings
es: Préstamos recibidos
ja: 借入金

source: Repayment of borrowings
es: Reembolso de préstamos
ja: 借入金の返済

source: Dividends paid
es: Dividendos pagados
ja: 支払配当金

source: Other financing cashflow
es: Otros flujos de efectivo de financiamiento
ja: その他の財務キャッシュフロー

source: Add Transaction
es: Agregar transacción
ja: 取引を追加

source: Transaction Records
es: Registros de transacciones
ja: 取引記録

source: Actions
es: Acciones
ja: 操作

source: Edit
es: Editar
ja: 編集

source: Delete
es: Eliminar
ja: 削除

source: Previous
es: Anterior
ja: 前へ

source: Next
es: Siguiente
ja: 次へ

source: Upload Cashflow Data
es: Subir datos de flujo de efectivo
ja: キャッシュフローデータをアップロード

source: Export as CSV
es: Exportar como CSV
ja: CSVとしてエクスポート

source: Export as Excel
es: Exportar como Excel
ja: Excelとしてエクスポート

source: Initial Cash Balance
es: Saldo inicial de efectivo
ja: 初期現金残高

source: Cash From Business Operation
es: Efectivo de operaciones comerciales
ja: 営業活動による現金

source: Cash from Financing and Other Activities
es: Efectivo de financiamiento y otras actividades
ja: 財務およびその他の活動による現金

source: Latest Cash Balance
es: Saldo de efectivo actual
ja: 最新現金残高

source: Monthly Burn Rate
es: Tasa de gasto mensual
ja: 月次バーンレート

source: Cash Runway
es: Autonomía de efectivo
ja: キャッシュランウェイ

source: Cash Runway Visualization
es: Visualización de autonomía de efectivo
ja: キャッシュランウェイの可視化

source: Balance by Date
es: Saldo por fecha
ja: 日付別残高

source: Calculate Balance
es: Calcular saldo
ja: 残高を計算

source: Monthly Cash Income
es: Ingresos mensuales en efectivo
ja: 月間現金収入

source: Monthly Cash Expenses
es: Gastos mensuales en efectivo
ja: 月間現金支出

source: Monthly Cash Balance Trend
es: Tendencia mensual del saldo de efectivo
ja: 月間現金残高の推移

source: Cash-out by Categories
es: Salida de efectivo por categoría
ja: カテゴリ別キャッシュアウト

source: Dashboard
es: Panel de control
ja: ダッシュボード

source: Welcome
es: Bienvenido
ja: ようこそ

source: Manage and analyze your cash flow with ease
es: Administra y analiza tu flujo de efectivo fácilmente
ja: 簡単にキャッシュフローを管理・分析できます

source: View your cash flow summary
es: Ver el resumen de tu flujo de efectivo
ja: キャッシュフローの概要を表示

source: Track your transactions
es: Rastrea tus transacciones
ja: 取引を追跡

source: Get AI-powered insights
es: Obtén información con tecnología de IA
ja: AIによるインサイトを取得

source: Import your transactions
es: Importa tus transacciones
ja: 取引をインポート

source: Choose CSV or Excel file
es: Elige un archivo CSV o Excel
ja: CSVまたはExcelファイルを選択

source: Supported formats: CSV, Excel (.xlsx, .xls)
es: Formatos compatibles: CSV, Excel (.xlsx, .xls)
ja: 対応フォーマット：CSV、Excel（.xlsx、.xls）

source: Data Preview
es: Vista previa de datos
ja: データプレビュー
